tests/staf-tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/modDN_wrongnewSuperior.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 628
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="[newSuperior] attribute has the same value than [dn] attribute"
   >
<modDNRequest
   dn="uid=abergin,ou=People,dc=siroe,dc=com"
   newrdn="uid=abergin"
   newSuperior="uid=abergin,ou=Peoples,dc=siroe,dc=com"
   deleteoldrdn="false">
</modDNRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
